uat_chat/Documents/ДоплатаПоБригадномуПодряду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ДоплатаПоБригадномуПодряду</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяРедакция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнфоТабЧасть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКРаспределению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месторождение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Месторождения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>суммаПовр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/AccumulationRegisters/РаботаВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РаботаВодителей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасовПоСделке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактЧасовПоСделке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыДляОборота</Name>
					<Comment>Часы не попадают в табель, нужны чтобы этот вид расчета включался в таблицу оборотов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПутевомуЛисту</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месторождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Месторождения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/ОтветственныеЛицаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/уатСведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатСведенияОСотрудниках</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>идДОк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Enums/ОтветственныеЛицаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДирЭкспл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлОпер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОТИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачПТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОЭ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Documents/ДоплатаПоБригадномуПодряду/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	| SELECT
	| &Дт Период,
	| ТблЗП.Сотрудник Водитель,
	| ТблЗП.ССылка.ВидРасчета ВидРасчета,
	| ТблЗП.ССылка.ЦехКонтрагента ЦехКонтрагента,
	| ТблЗП.ССылка.ЦехКонтрагента.Владелец Контрагент,
	| НачалоПериода(&Дт,МЕсяц) ПериодРаботы,
	| &Дт ДатаРаботы,
	| тблЗП.ТранспортноеСредство ТС,
	| 0  Тариф,
	| CASE WHEN ТБлЗП.ВремяРаботы = 0 THEN 1 ELSE 0 END ЧасыДляОборота,
	|  ТБлЗП.ВремяРаботы Количество,
	| тблЗП.Сумма Сумма
	|
	|FROM Документ.ДоплатаПоБригадномуПодряду.Исполнители как тблЗП
	|WHERE тблЗП.ссылка = &сс
	|   и  Сумма<>0
	|";
	
	запрос.УстановитьПараметр("сс",Ссылка);
	запрос.УстановитьПараметр("Дт",КонецДня(Дата));
	
	Рег = Движения.РаботаВодителей;
	Рег.Загрузить(Запрос.Выполнить().Выгрузить());
	Рег.Записать();
	

КонецПроцедуры

Функция СткШапка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтвРук.ФизическоеЛицо Рук,
	               |	ОтвОтиз.ФизическоеЛицо КАК ОТИЗ,
	               |	ОтвОК.ФизическоеЛицо КАК ОК
	               |ИЗ
	               |	Документ.ДоплатаПоБригадномуПодряду КАК ТабельКС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дт,ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизации.ДирЭкспл)) КАК ОтвРук
	               |		ПО ТабельКС.Организация = ОтвРук.СтруктурнаяЕдиница
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дт,ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизации.НачОТИЗ)) КАК ОтвОтиз
	               |		ПО ТабельКС.Организация = ОтвОтиз.СтруктурнаяЕдиница
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дт,ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизации.НачОК)) КАК ОтвОК
	               |		ПО ТабельКС.Организация = ОтвОК.СтруктурнаяЕдиница
				   |WHERE &сс = ссылка";
				   Запрос.УстановитьПараметр("Дт",Ссылка.Дата);
				   Запрос.УстановитьПараметр("сс",Ссылка);
				   тбл = запрос.Выполнить().Выгрузить();
				   
				   Стк = Новый Структура("Рук,ДлжРук,ОТИЗ,ДлжОТИЗ,Нач,ДлжНач,ОК,ДлжОК,ДлжДисп,Дисп");
				   ЗаполнитьЗначенияСвойств(Стк,Тбл[0]);
				   
				   С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Тбл[0].Рук,Дата);
				   Стк.Рук = С.Представление;
				   Стк.длжРук = С.Должность;
				   
				   С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Тбл[0].ОТИЗ,Дата);
				   Стк.ОТИЗ = С.Представление;
				   Стк.длжОТИЗ = С.Должность;
				   
				   С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Тбл[0].ОК,Дата);
				   Стк.ОК = С.Представление;
				   Стк.длжОК = С.Должность;
				   
				   Возврат Стк;
	
КонецФункции

Функция ДанныеПечать()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеНачислениеИсполнители.Сотрудник,
	               |	CASE WHEN Ссылка.Проведен THEN  ДополнительныеНачислениеИсполнители.КТУ ELSE 0 END КТУ,
	               |	СУММА(CASE WHEN Ссылка.Проведен THEN ДополнительныеНачислениеИсполнители.сумма ELSE 0 END) КАК сумма,
	               |	СУММА(ДополнительныеНачислениеИсполнители.суммаПовр) КАК суммаПовр,
	               |	СУММА(ДополнительныеНачислениеИсполнители.ВремяРаботы) КАК ВремяРаботы,
	               |	ДополнительныеНачислениеИсполнители.Сотрудник.Код КАК Код,
	               |	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации
	               |ИЗ
	               |	Документ.ДоплатаПоБригадномуПодряду.Исполнители КАК ДополнительныеНачислениеИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&Дт, Сотрудник В (&МасСотр)) КАК уатСведенияОСотрудникахСрезПоследних
	               |		ПО ДополнительныеНачислениеИсполнители.Сотрудник = уатСведенияОСотрудникахСрезПоследних.Сотрудник
	               |ГДЕ
	               |	ДополнительныеНачислениеИсполнители.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДополнительныеНачислениеИсполнители.Сотрудник,
	               |	ДополнительныеНачислениеИсполнители.Ссылка.Проведен,
	               |	ДополнительныеНачислениеИсполнители.КТУ,
	               |	ДополнительныеНачислениеИсполнители.Сотрудник.Код,
	               |	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации";
				   
				   Запрос.УстановитьПараметр("ССылка",ССылка);
				   Запрос.УстановитьПараметр("Дт",ССылка.Дата);
				   Запрос.УстановитьПараметр("МасСотр",Ссылка.Исполнители.ВыгрузитьКолонку("Сотрудник"));
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура Печать() Экспорт
	
	
	Если Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Исполнители.Количество()=0 ТОгда
		Предупреждение("Нет данных для вывода на печать!");
		Возврат;
	КонецеСЛИ;
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ДокументЗПпоБП";
	Макет = ПолучитьМакет("Макет");
	
	СткШапка = СткШапка();
	
	обШапка = Макет.ПолучитьОбласть("Шапка");
	обСтрока = Макет.ПолучитьОбласть("Строка");
	обИтог = Макет.ПолучитьОбласть("Итог");
	
	обШАпка.Параметры.Заполнить(ССылка);
	обШАпка.Параметры.Заполнить(СткШапка);
	//обШапка.Параметры.ДАтаДОк = Формат(Ссылка.Дата,"ДФ=dd.MM.yyyy");
	Таб.Вывести(обШапка);
	ТБл = ДанныеПечать();
	ном = 0;
	ДЛя каждого стр из Тбл Цикл
		
		обСтрока.Параметры.Заполнить(Стр);
		ном= ном+1;
		обСтрока.Параметры.НомерСтроки = ном;
		Таб.Вывести(обСтрока);
		
	КонецЦикла;
	
	Тбл.свернуть("","Сумма,СуммаПовр,ВремяРаботы");
	обИтог.Параметры.Заполнить(СткШапка);
	обИтог.Параметры.Заполнить(Тбл[0]);
	
	Таб.Вывести(обИтог);
	
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.Показать();
	
КонецПроцедуры
